BACnetTesting/BACnet-Stack/bacnet/bits/board/STMicro/stm32f4-discovery/dlmstp.c
/**************************************************************************
*
* Copyright (C) 2006 Steve Karg <skarg@users.sourceforge.net>
*
* Permission is hereby granted, free of charge, to any person obtaining
* a copy of this software and associated documentation files (the
* "Software"), to deal in the Software without restriction, including
* without limitation the rights to use, copy, modify, merge, publish,
* distribute, sublicense, and/or sell copies of the Software, and to
* permit persons to whom the Software is furnished to do so, subject to
* the following conditions:
*
* The above copyright notice and this permission notice shall be included
* in all copies or substantial portions of the Software.
*
* THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
* MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.
* IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY
* CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT,
* TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN CONNECTION WITH THE
* SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.

    Modifications Copyright (C) 2017 BACnet Interoperability Testing Services, Inc.

    July 1, 2017    BITS    Modifications to this file have been made in compliance
                            to original licensing.

    This file contains changes made by BACnet Interoperability Testing
    Services, Inc. These changes are subject to the permissions,
    warranty terms and limitations above.
    For more information: info@bac-test.com
    For access to source code:  info@bac-test.com
            or      www.github.com/bacnettesting/bacnet-stack

*********************************************************************/

#include "stm32f4xx_hal.h"
#include "stm32f4xx.h"
#include "stm32f4xx_it.h"

#include <stdbool.h>
#include <stdint.h>
#include <stddef.h>
//#include <stdlib.h>
//#include <string.h>
//#include <stdio.h>
#include "bacdef.h"
//#include "bacaddr.h"
#include "dlmstp.h"
#include "rs485common.h"
#include "crc.h"
#include "npdu.h"
#include "bits.h"
#include "timerCommon.h"
#include "ringbuf.h"
#include "mstpdef.h"
// todo2 #include "automac.h"
#include "emm.h"
#include "datalink.h"
#include "ese.h"
#include "scope.h"

/* Number of MS/TP Packets Rx/Tx */
uint16_t MSTP_Packets = 0;

/* packet queues */
static DLMSTP_PACKET Receive_Packet;
// static HANDLE Receive_Packet_Flag;
/* mechanism to wait for a frame in state machine */
// HANDLE Received_Frame_Flag;
DLMSTP_PACKET Transmit_Packet;
/* local MS/TP port data - shared with RS-485 */
volatile struct mstp_port_struct_t MSTP_Port;
/* buffers needed by mstp port struct */
// static uint8_t TxBuffer[MAX_MPDU];
static uint8_t RxBuffer[MAX_MPDU_MSTP];
/* The minimum time without a DataAvailable or ReceiveError event */
/* that a node must wait for a station to begin replying to a */
/* confirmed request: 255 milliseconds. (Implementations may use */
/* larger values for this timeout, not to exceed 300 milliseconds.) */
uint16_t Treply_timeout = 260;
/* The minimum time without a DataAvailable or ReceiveError event that a */
/* node must wait for a remote node to begin using a token or replying to */
/* a Poll For Master frame: 20 milliseconds. (Implementations may use */
/* larger values for this timeout, not to exceed 100 milliseconds.) */
uint8_t Tusage_timeout = 50;

/* count must be a power of 2 for ringbuf library */
#ifndef MSTP_TRANSMIT_PACKET_COUNT
#define MSTP_TRANSMIT_PACKET_COUNT 1
#endif
static struct mstp_tx_packet Transmit_Buffer[MSTP_TRANSMIT_PACKET_COUNT];
RING_BUFFER Transmit_Byte_Ringbuffer;

/* data structure for MS/TP PDU Queue */
// moved to mstp.h
//struct mstp_pdu_packet {
//    LLIST_LB    ll_lb;          // must be first
//
//    bool data_expecting_reply;
//    uint8_t destination_mac;
//    // uint16_t length;
//    // uint8_t buffer[MAX_MPDU_MSTP];
//    DLCB *dlcb;
//};

extern MOW_TYPE priorMOW;
extern bool scopetrigger;

/* This parameter represents the value of the Max_Info_Frames property of */
/* the node's Device object. The value of Max_Info_Frames specifies the */
/* maximum number of information frames the node may send before it must */
/* pass the token. Max_Info_Frames may have different values on different */
/* nodes. This may be used to allocate more or less of the available link */
/* bandwidth to particular nodes. If Max_Info_Frames is not writable in a */
/* node, its value shall be 1. [BTC] */
// static uint8_t Nmax_info_frames = MSTP_PDU_PACKET_COUNT;


bool dlmstp_init(
    char *ifname)
{
    unsigned long hThread = 0;
    uint32_t arg_value = 0;

    /* initialize packet queue */
    Receive_Packet.ready = false;
    Receive_Packet.pdu_len = 0;
    
    /* initialize hardware */
    timer_init();
    
    Ringbuf_Init(&Transmit_Byte_Ringbuffer,
        (uint8_t *) Transmit_Buffer,
        sizeof(struct mstp_tx_packet),
        MSTP_TRANSMIT_PACKET_COUNT);
    
    //    Ringbuf_Init(&PDU_Queue, (uint8_t *) & PDU_Buffer,
    //        sizeof(struct mstp_pdu_packet), MSTP_PDU_PACKET_COUNT);
        
    RS485_Initialize();

    // todo2    
//    automac_init();

    MSTP_Port.InputBuffer = &RxBuffer[0];
    MSTP_Port.InputBufferSize = sizeof(RxBuffer);
    // now on Queue MSTP_Port->OutputBuffer = &TxBuffer[0];
    // now on Queue MSTP_Port->OutputBufferSize = sizeof(TxBuffer);
    //    MSTP_Port.SilenceTimer = Timer_Silence;
    //    MSTP_Port.SilenceTimerReset = Timer_Silence_Reset;
    
    MSTP_Init(&MSTP_Port);
    
#if 0
    uint8_t data;

    /* FIXME: implement your data storage */
    data = 64; /* I2C_Read_Byte(
                   EEPROM_DEVICE_ADDRESS,
                   EEPROM_MSTP_MAC_ADDR); */
    if (data <= 127)
        MSTP_Port.This_Station = data;
    else
        dlmstp_set_my_address(DEFAULT_MAC_ADDRESS);
    /* FIXME: implement your data storage */
    data = 127; /* I2C_Read_Byte(
                   EEPROM_DEVICE_ADDRESS,
                   EEPROM_MSTP_MAX_MASTER_ADDR); */
    if ((data <= 127) && (data >= MSTP_Port.This_Station))
        MSTP_Port.Nmax_master = data;
    else
        dlmstp_set_max_master(DEFAULT_MAX_MASTER);
    /* FIXME: implement your data storage */
    data = 1;
    /* I2C_Read_Byte(
       EEPROM_DEVICE_ADDRESS,
       EEPROM_MSTP_MAX_INFO_FRAMES_ADDR); */
    if (data >= 1)
        MSTP_Port.Nmax_info_frames = data;
    else
        dlmstp_set_max_info_frames(DEFAULT_MAX_INFO_FRAMES);
#endif
    return true;
}


