BACnetTesting/BACnet-Stack/bacnet/bits/board/STMicro/stm32f4-discovery/dlmstp.c
// Timer that indicates line silence
uint32_t SilenceTimer(
    volatile mstp_port_struct *mstp_port) 
{
    return timer_elapsed_time(&mstp_port->silenceTimer);
}


void SilenceTimerReset(
    volatile mstp_port_struct *mstp_port)
{
    timer_elapsed_start(&mstp_port->silenceTimer);
}


void dlmstp_cleanup(
    void)
{
    /* nothing to do for static buffers */
}


/* returns number of bytes sent on success, zero on failure */
int dlmstp_send_pdu(
    BACNET_ADDRESS * dest,          /* destination address */
    BACNET_NPCI_DATA * npci_data,   /* network information */
    uint8_t * pdu,                  /* any data to be sent - may be null */
    unsigned pdu_len)               /* number of bytes of data */
{
    DLCB *dlcb;
    
    if (npci_data->data_expecting_reply )
    {
        dlcb = alloc_dlcb_new_message('a', dest->mac[0] );
    }
    else
    {
        dlcb = alloc_dlcb_response('b', dest->mac[0] );
    }
    if (dlcb == NULL) return 0 ;

    if (dlcb->optr > MAX_MPDU_MSTP) {
        dlcb_free(dlcb);
        panic();
        return 0;
    }

#if ( BAC_DEBUG == 1 )
    dlcb_check(dlcb);
#endif
    
    dlcb->optr = pdu_len;
    memcpy(dlcb->Handler_Transmit_Buffer, pdu, pdu_len);

    // ----

    int bytes_sent = dlcb->optr;

    struct mstp_pdu_packet *pkt = (struct mstp_pdu_packet *) emm_scalloc('t', sizeof(struct mstp_pdu_packet));
    if (pkt == NULL) {
        dlcb_free(dlcb);
        return 0;
    }

    // hmm.. do we care todo1
    pkt->data_expecting_reply = npci_data->data_expecting_reply ;

    pkt->dlcb = dlcb;

    // pkt->length = dlcb-> ;
    if(dest->mac_len)
    {
        pkt->destination_mac = dest->mac[0];
    }
    else
    {
        /* mac_len = 0 is a broadcast address */
        pkt->destination_mac = MSTP_BROADCAST_ADDRESS;
    }

    if (!ll_Enqueue(&MSTP_Port.mstpOutputQueuePtr, pkt)) {
        // SendBTApanicMessage("mxxxx - MSTP output queue full");
        ese_enqueue_once(ese009_09_mstp_output_queue_full);
        dlcb_free(dlcb);
        emm_free(pkt);
        // slight rearrange due to possible race-condition
        return 0;
    }

    return bytes_sent;
}


uint16_t dlmstp_receive(
    BACNET_ADDRESS * src,       /* source address */
    uint8_t * pdu,              /* PDU data */
    uint16_t max_pdu,           /* amount of space available in the PDU  */
    unsigned timeout)           /* milliseconds to wait for a packet */
{
    
    uint16_t pdu_len = 0;
    //    DWORD wait_status = 0;

        (void) max_pdu;
    /* see if there is a packet available, and a place
       to put the reply (if necessary) and process it */
    //    wait_status = WaitForSingleObject(Receive_Packet_Flag, timeout);
    //    if (wait_status == WAIT_OBJECT_0) {
    if(Receive_Packet.ready) {
        if (Receive_Packet.pdu_len) {
            MSTP_Packets++;
            if (src) {
                memmove(src,
                    &Receive_Packet.address,
                    sizeof(Receive_Packet.address));
            }
            if (pdu) {
                memmove(pdu,
                    &Receive_Packet.pdu,
                    sizeof(Receive_Packet.pdu));
            }
            pdu_len = Receive_Packet.pdu_len;
        }
        Receive_Packet.ready = false;
    }
    //    }

        return pdu_len;
}



void dlmstp_fill_bacnet_address(
    BACNET_ADDRESS * src,
    uint8_t mstp_address)
{
    int i = 0;

    if (mstp_address == MSTP_BROADCAST_ADDRESS) {
        /* mac_len = 0 if broadcast address */
        src->mac_len = 0;
        src->mac[0] = 0;
    }
    else {
        src->mac_len = 1;
        src->mac[0] = mstp_address;
    }
    /* fill with 0's starting with index 1; index 0 filled above */
    for (i = 1; i < MAX_MAC_LEN; i++) {
        src->mac[i] = 0;
    }
    src->net = 0;
    src->len = 0;
    for (i = 0; i < MAX_MAC_LEN; i++) {
        src->adr[i] = 0;
    }
}

/* for the MS/TP state machine to use for putting received data */
uint16_t MSTP_Put_Receive(
    volatile struct mstp_port_struct_t *mstp_port)
{
    uint16_t pdu_len = 0;
    //    bool rc;

    if(!Receive_Packet.ready) {
        /* bounds check - maybe this should send an abort? */
        pdu_len = mstp_port->DataLength;
        if (pdu_len > sizeof(Receive_Packet.pdu))
        {
            pdu_len = sizeof(Receive_Packet.pdu);
        }
        memmove((void *) &Receive_Packet.pdu[0],
            (void *) &mstp_port->InputBuffer[0],
            pdu_len);
        dlmstp_fill_bacnet_address(&Receive_Packet.address,
            mstp_port->SourceAddress);
        Receive_Packet.pdu_len = mstp_port->DataLength;
        Receive_Packet.ready = true;
        //        rc = ReleaseSemaphore(Receive_Packet_Flag, 1, NULL);
        //        (void) rc;
    }

    return pdu_len;
}

/* for the MS/TP state machine to use for getting data to send */
/* Return: amount of PDU data */
//uint16_t MSTP_Get_Send(
//    volatile struct mstp_port_struct_t * mstp_port,
//    unsigned timeout)
//{
//    /* milliseconds to wait for a packet */
//    uint16_t pdu_len = 0;
//    uint8_t destination = 0; /* destination address */
//
//    (void) timeout;
//    if (!Transmit_Packet.ready) {
//        return 0;
//    }
//    /* load destination MAC address */
//    if (Transmit_Packet.address.mac_len) {
//        destination = Transmit_Packet.address.mac[0];
//    }
//    else {
//        destination = MSTP_BROADCAST_ADDRESS;
//    }
//    
//    if ((MAX_MAC_HEADER_MSTP + Transmit_Packet.pdu_len) > MAX_MPDU_MSTP) {
//        // todo 0 panic 
//        return 0;
//    }
//    
//    /* convert the PDU into the MSTP Frame */
//    pdu_len = MSTP_Create_Frame(&mstp_port->OutputBuffer[0],
//        /* <-- loading this */
//        sizeof( mstp_port->OutputBuffer ),
//        Transmit_Packet.frame_type,
//        destination,
//        mstp_port->This_Station,
//        &Transmit_Packet.pdu[0],
//        Transmit_Packet.pdu_len);
//    Transmit_Packet.ready = false;
//
//    return pdu_len;
//}


static bool dlmstp_compare_data_expecting_reply(
    uint8_t * request_pdu,
    uint16_t request_pdu_len,
    uint8_t src_address,
    uint8_t * reply_pdu,
    uint16_t reply_pdu_len,
    BACNET_ADDRESS * dest_address)
{
    uint16_t offset;
    /* One way to check the message is to compare NPDU
       src, dest, along with the APDU type, invoke id.
       Seems a bit overkill */
    struct DER_compare_t {
        BACNET_NPCI_DATA npci_data;
        BACNET_ADDRESS address;
        uint8_t pdu_type;
        uint8_t invoke_id;
        uint8_t service_choice;
    };
    struct DER_compare_t request;
    struct DER_compare_t reply;

    /* unused parameters */
    request_pdu_len = request_pdu_len;
    reply_pdu_len = reply_pdu_len;
    /* decode the request data */
    request.address.mac[0] = src_address;
    request.address.mac_len = 1;
    offset =
        (uint16_t) npdu_decode(&request_pdu[0],
        NULL,
        &request.address,
        &request.npci_data);
    if (request.npci_data.network_layer_message) {
        return false;
    }
    request.pdu_type = request_pdu[offset] & 0xF0;
    if (request.pdu_type != PDU_TYPE_CONFIRMED_SERVICE_REQUEST) {
        return false;
    }
    request.invoke_id = request_pdu[offset + 2];
    /* segmented message? */
    if (request_pdu[offset] & BIT3)
        request.service_choice = request_pdu[offset + 5];
    else
        request.service_choice = request_pdu[offset + 3];
    /* decode the reply data */
    bacnet_address_copy(&reply.address, dest_address);
    offset =
        (uint16_t) npdu_decode(&reply_pdu[0],
        &reply.address,
        NULL,
        &reply.npci_data);
    if (reply.npci_data.network_layer_message) {
        return false;
    }
    /* reply could be a lot of things:
       confirmed, simple ack, abort, reject, error */
    reply.pdu_type = reply_pdu[offset] & 0xF0;
    switch (reply.pdu_type) {
    case PDU_TYPE_CONFIRMED_SERVICE_REQUEST:
        reply.invoke_id = reply_pdu[offset + 2];
        /* segmented message? */
        if (reply_pdu[offset] & BIT3)
            reply.service_choice = reply_pdu[offset + 5];
        else
            reply.service_choice = reply_pdu[offset + 3];
        break;
    case PDU_TYPE_SIMPLE_ACK:
        reply.invoke_id = reply_pdu[offset + 1];
        reply.service_choice = reply_pdu[offset + 2];
        break;
    case PDU_TYPE_COMPLEX_ACK:
        reply.invoke_id = reply_pdu[offset + 1];
        /* segmented message? */
        if (reply_pdu[offset] & BIT3)
            reply.service_choice = reply_pdu[offset + 4];
        else
            reply.service_choice = reply_pdu[offset + 2];
        break;
    case PDU_TYPE_ERROR:
        reply.invoke_id = reply_pdu[offset + 1];
        reply.service_choice = reply_pdu[offset + 2];
        break;
    case PDU_TYPE_REJECT:
    case PDU_TYPE_ABORT:
        reply.invoke_id = reply_pdu[offset + 1];
        break;
    default:
        return false;
    }
    /* these don't have service choice included */
    if ((reply.pdu_type == PDU_TYPE_REJECT) ||
        (reply.pdu_type == PDU_TYPE_ABORT)) {
        if (request.invoke_id != reply.invoke_id) {
            return false;
        }
    }
    else {
        if (request.invoke_id != reply.invoke_id) {
            return false;
        }
        if (request.service_choice != reply.service_choice) {
            return false;
        }
    }
    if (request.npci_data.protocol_version != reply.npci_data.protocol_version) {
        return false;
    }
#if 0
    /* the NDPU priority doesn't get passed through the stack, and
       all outgoing messages have NORMAL priority */
    if (request.npci_data.priority != reply.npci_data.priority) {
        return false;
    }
#endif
    
    if (!bacnet_address_same(&request.address, &reply.address)) {
        return false;
    }

