BACnetTesting/BACnet-Stack/bacnet/bits/board/STMicro/stm32f4-discovery/dlmstp.c
    return true;
}


struct mstp_tx_packet *pkt;
volatile struct  mstp_port_struct_t *tx_mstp_port;
MSTP_TX_STATE tx_mstp_state = MSTP_TX_STATE_IDLE;

static bool MSTP_Transmit_FSM(
    volatile mstp_port_struct *mstp_port )
{

    tx_mstp_port = mstp_port;

MSTP_TX_START:
    switch (tx_mstp_state) {
    case MSTP_TX_STATE_IDLE:
        if (!Ringbuf_Empty(&Transmit_Byte_Ringbuffer)) {
            /* get the packet - but don't remove it from queue */
            pkt = (struct mstp_tx_packet *)
                Ringbuf_Peek(&Transmit_Byte_Ringbuffer);
            tx_mstp_state = MSTP_TX_STATE_SILENCE_WAIT;
        }
        break;

    case MSTP_TX_STATE_SILENCE_WAIT:
        if (rs485_turnaround_elapsed(mstp_port)) {

            if (scopetrigger) {
                bits_ScopeTrigger();
                scopetrigger = false;
            }

            rs485_rts_enable(mstp_port, true);
            pkt->index = 0;
            rs485_byte_send(mstp_port, pkt->buffer[pkt->index]);
            tx_mstp_state = MSTP_TX_STATE_SEND_WAIT;
            /* optimize a little - for slower CPUs */
            goto MSTP_TX_START;
        }
        break;

    case MSTP_TX_STATE_SEND_WAIT:
        break;
        // the rest will be done by the Tx Interrupt handler
        //    if (rs485_byte_sent(mstp_port)) {
    //        pkt->index++;
    //        if (pkt->index < pkt->length) {
    //            /* send next byte */
    //            rs485_byte_send(mstp_port, pkt->buffer[pkt->index]);
    //            /* optimize a little - for slower CPUs */
    //            goto MSTP_TX_START;
    //        }
    //        else {
    //            state = MSTP_TX_STATE_STOP;
    //        }
    //    }
    //    break;
    //case MSTP_TX_STATE_STOP:
    //    if (rs485_byte_sent(mstp_port) && rs485_frame_sent(mstp_port)) {
    //        rs485_rts_enable(mstp_port, false);
    //        /* remove the packet from the queue */
    //        (void) Ringbuf_Pop(&Transmit_Queue, NULL);
    //        state = MSTP_TX_STATE_IDLE;
    //    }
    //    break;
    //default:
    //    state = MSTP_TX_STATE_IDLE;
    //    break;
    }

    return (tx_mstp_state != MSTP_TX_STATE_IDLE);
}

extern bool scopetrigger ;

void dllmstp_Send_Frame(
    volatile struct mstp_port_struct_t *mstp_port,
    /* port to send from */
    uint8_t *data,                                    
    uint16_t data_len)
{
    struct mstp_tx_packet *pkt;
    pkt = (struct mstp_tx_packet *) Ringbuf_Data_Peek(&Transmit_Byte_Ringbuffer);
    if (pkt) {
        for (int i = 0; i < data_len; i++) {
            pkt->buffer[i] = data[i];
        }
        pkt->length = data_len;
        Ringbuf_Data_Put(&Transmit_Byte_Ringbuffer, (uint8_t *)pkt);
    }
}


/* Get the reply to a DATA_EXPECTING_REPLY frame, or nothing */
uint16_t MSTP_Get_Reply(
    volatile struct mstp_port_struct_t * mstp_port,
    unsigned timeout)
{
    /* milliseconds to wait for a packet */
    uint16_t pdu_len = 0; /* return value */
    uint8_t destination = 0; /* destination address */
    bool matched = false;

    (void) timeout;
    if (!Transmit_Packet.ready) {
        return 0;
    }
    /* load destination MAC address */
    if (Transmit_Packet.address.mac_len == 1) {
        destination = Transmit_Packet.address.mac[0];
    }
    else {
        return 0;
    }
    if ((MAX_MAC_HEADER_MSTP + Transmit_Packet.pdu_len) > MAX_MPDU_MSTP) {
        return 0;
    }
    /* is this the reply to the DER? */
    matched =
        dlmstp_compare_data_expecting_reply(&mstp_port->InputBuffer[0],
        mstp_port->DataLength,
        mstp_port->SourceAddress,
        &Transmit_Packet.pdu[0],
        Transmit_Packet.pdu_len,
        &Transmit_Packet.address);
    if (!matched)
        return 0;
    /* convert the PDU into the MSTP Frame */
    pdu_len = MSTP_Create_Frame(&mstp_port->OutputBuffer[0],
        /* <-- loading this */
        sizeof ( mstp_port->OutputBuffer),
        Transmit_Packet.frame_type,
        destination,
        mstp_port->This_Station,
        &Transmit_Packet.pdu[0],
        Transmit_Packet.pdu_len);
    Transmit_Packet.ready = false;

    return pdu_len;
}


#if 0
// TODO LATER   
/* master node FSM states */
typedef enum {
    AUTOMAC_STATE_IDLE = 0,
    AUTOMAC_STATE_PFM = 1,
    AUTOMAC_STATE_TOKEN = 2,
    AUTOMAC_STATE_TESTING = 3,
    AUTOMAC_STATE_CONFIRM = 4
} AUTOMAC_STATE;
/* buffer used to send and validate a response - size is min APDU size */
static uint8_t AutoMAC_Test_Buffer[50];
void dlmstp_automac_hander(
    void)
{
    static AUTOMAC_STATE state = AUTOMAC_STATE_IDLE;
    uint8_t mac = 0;
    uint32_t serial_number = 0;
    uint16_t vendor_id = 0;
    bool take_address = false;
    bool start_over = false;

    switch (state) {
    case AUTOMAC_STATE_IDLE:
        if ((MSTP_Flag.ReceivedValidFrame) ||
            (MSTP_Flag.ReceivedValidFrameNotForUs)) {
            MSTP_Flag.ReceivedValidFrame = false;
            MSTP_Flag.ReceivedValidFrameNotForUs = false;
            /* store stats until we get a MAC */
            automac_emitter_set(SourceAddress);
            switch (FrameType) {
            case FRAME_TYPE_TOKEN:
                automac_token_set(SourceAddress);
                break;
            case FRAME_TYPE_POLL_FOR_MASTER:
                automac_pfm_set(DestinationAddress);
                break;
            default:
                break;
            }
        }
        else if (MSTP_Flag.ReceivedInvalidFrame) {
            MSTP_Flag.ReceivedInvalidFrame = false;
        }
        else if (automac_pfm_cycle_complete()) {
            mac = automac_free_address_random();
            if (automac_free_address_valid(mac)) {
                automac_address_set(mac);
                state = AUTOMAC_STATE_PFM;
            }
            else {
                /* start over again */
                automac_init();
                state = AUTOMAC_STATE_IDLE;
            }
        }
        else if (rs485_silence_elapsed(automac_time_slot())) {
            /*  long silence indicates we are alone or
               with other silent devices */
            SourceAddress = automac_address();
            state = AUTOMAC_STATE_TESTING;
        }
        break;
    case AUTOMAC_STATE_PFM:
        if ((MSTP_Flag.ReceivedValidFrame) ||
            (MSTP_Flag.ReceivedValidFrameNotForUs)) {
            MSTP_Flag.ReceivedValidFrame = false;
            MSTP_Flag.ReceivedValidFrameNotForUs = false;
            /* store stats until we get a MAC */
            switch (FrameType) {
            case FRAME_TYPE_POLL_FOR_MASTER:
                mac = automac_address();
                if (mac == SourceAddress) {
                    /* start over again */
                    automac_init();
                    state = AUTOMAC_STATE_IDLE;
                }
                else if (mac == DestinationAddress) {
                    MSTP_Send_Frame
                        (FRAME_TYPE_REPLY_TO_POLL_FOR_MASTER,
                        SourceAddress,
                        mac,
                        NULL,
                        0);
                    state = AUTOMAC_STATE_TOKEN;
                }
                break;
            case FRAME_TYPE_TEST_REQUEST:
                mac = automac_address();
                if ((mac == DestinationAddress) ||
                    (mac == SourceAddress)) {
                    /* start over again */
                    automac_init();
                    state = AUTOMAC_STATE_IDLE;
                }
                break;
            case FRAME_TYPE_BACNET_DATA_NOT_EXPECTING_REPLY:
            case FRAME_TYPE_BACNET_DATA_EXPECTING_REPLY:
            case FRAME_TYPE_TEST_RESPONSE:
            case FRAME_TYPE_TOKEN:
                mac = automac_address();
                if (mac == SourceAddress) {
                    /* start over again */
                    automac_init();
                    state = AUTOMAC_STATE_IDLE;
                }
                break;
            default:
                break;
            }
        }
        else if (MSTP_Flag.ReceivedInvalidFrame) {
            MSTP_Flag.ReceivedInvalidFrame = false;
        }
        else if (rs485_silence_elapsed(automac_time_slot())) {
            /* start over again */
            automac_init();
            state = AUTOMAC_STATE_IDLE;
        }
        break;
    case AUTOMAC_STATE_TOKEN:
        if ((MSTP_Flag.ReceivedValidFrame) ||
            (MSTP_Flag.ReceivedValidFrameNotForUs)) {
            MSTP_Flag.ReceivedValidFrame = false;
            MSTP_Flag.ReceivedValidFrameNotForUs = false;
            switch (FrameType) {
            case FRAME_TYPE_TOKEN:
                mac = automac_address();
                if (mac == SourceAddress) {
                    /* start over again */
                    automac_init();
                    state = AUTOMAC_STATE_IDLE;
                }
                else if (mac == DestinationAddress) {
                    state = AUTOMAC_STATE_TESTING;
                }
                break;
            default:
                /* start over again */
                automac_init();
                state = AUTOMAC_STATE_IDLE;
                break;
            }
        }
        else if (MSTP_Flag.ReceivedInvalidFrame) {
            MSTP_Flag.ReceivedInvalidFrame = false;
        }
        else if (rs485_silence_elapsed(automac_time_slot())) {
            /* start over again */
            automac_init();
            state = AUTOMAC_STATE_IDLE;
        }
        break;
    case AUTOMAC_STATE_TESTING:
        /* I have the token - confirm my MAC with a quick test */
        mac = automac_address();
        vendor_id = Device_Vendor_Identifier();
        encode_unsigned16(&AutoMAC_Test_Buffer[0], vendor_id);
        serial_number = Device_Object_Instance_Number();
        encode_unsigned32(&AutoMAC_Test_Buffer[2], serial_number);
        MSTP_Send_Frame(FRAME_TYPE_TEST_REQUEST,
            SourceAddress,
            mac,
            &AutoMAC_Test_Buffer[0],
            6);
        state = AUTOMAC_STATE_CONFIRM;
        break;
    case AUTOMAC_STATE_CONFIRM:
        /* we may timeout if our chosen MAC is unique */
        if (MSTP_Flag.ReceivedInvalidFrame) {
            MSTP_Flag.ReceivedInvalidFrame = false;
            start_over = true;
        }
        else if ((MSTP_Flag.ReceivedValidFrame) ||
            (MSTP_Flag.ReceivedValidFrameNotForUs)) {
            MSTP_Flag.ReceivedValidFrame = false;
            MSTP_Flag.ReceivedValidFrameNotForUs = false;
            mac = automac_address();
            if ((mac == DestinationAddress) && (DataLength >= 6)) {
                decode_unsigned16(&InputBuffer[0], &vendor_id);
                decode_unsigned32(&InputBuffer[2], &serial_number);
                if ((vendor_id == Device_Vendor_Identifier()) &&
                    (serial_number == Device_Object_Instance_Number())) {
                    take_address = true;
                }
                else {
                    start_over = true;
                }
            }
            else {
                start_over = true;
            }
        }
        else if (rs485_silence_elapsed(300)) {
            /* use maximum possible value for Treply_timeout */
            /* in case validating device doesn't support Test Request */
            /* no response and no collission */
            take_address = true;
        }
        if (take_address) {
            /* take the address */
            This_Station = automac_address();
            DestinationAddress = automac_next_station(This_Station);
            if (DestinationAddress < 128) {
                MSTP_Send_Frame(FRAME_TYPE_TOKEN,
                    DestinationAddress,
                    This_Station,
                    NULL,
                    0);
            }
            state = AUTOMAC_STATE_IDLE;
        }
        else if (start_over) {
            /* start over again */
            automac_init();
            state = AUTOMAC_STATE_IDLE;
        }
        break;
    default:
        break;
    }
}
#endif

// call this as often as possible, 1 to 5ms _at least_, per the spec.
void dlmstp_tick(
    volatile struct mstp_port_struct_t *mstp_port)
{
    bool transmitting = false;
    bool run_master = false;

