BACnetTesting/BACnet-Stack/bacnet/bits/board/STMicro/stm32f4-discovery/dlmstp.c
#if 0
    if (This_Station == 255) {
        automac_enabled_set(true);
    }
#endif
    if (mstp_port->receive_state == MSTP_RECEIVE_STATE_IDLE) {
        transmitting = MSTP_Transmit_FSM(mstp_port);
    }

    if (transmitting == false) {

        if (mstp_port->ReceivedValidFrame == false &&
            mstp_port->ReceivedValidFrameNotForUs == false &&
            mstp_port->ReceivedInvalidFrame == false) {
            /* only do receive state machine while we don't have a frame */
            // and then do it at least once (for the timers)
            // and keep repeating if there are more characters to process,
            // unless of course, we end up receiving a whole frame..
            RS485_Check_UART_Data(mstp_port);    
            do
            {
                MSTP_Receive_Frame_FSM(mstp_port);
            } while (
                mstp_port->ReceivedValidFrame == false &&
                mstp_port->ReceivedValidFrameNotForUs == false &&
                mstp_port->ReceivedInvalidFrame == false &&
                    RS485_Check_UART_Data(mstp_port))
        ;
        }
    }
    
#if 0    
    // todo1 temp
    mstp_port->ReceivedInvalidFrame = false;
    mstp_port->ReceivedValidFrame = false;
    mstp_port->ReceivedValidFrameNotForUs = false;
    return;
#endif  

    if (mstp_port->btaReceivedValidFrame) {
        mstp_port->btaReceivedValidFrame = false;
        // done its job - 48us HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_SET);
        if (mstp_port->DataLength > 0) {
        }
        if (mstp_port->DataLength > 0) {
            mstp_port->DataLength = mstp_port->DataLength;
        }
        SendBTAmstpPayload(
                           1,
                           false, // rx 
                           mstp_port->DataLength, mstp_port->FrameType, mstp_port->DestinationAddress,
                           mstp_port->SourceAddress, mstp_port->InputBuffer );
        // done its job - 48us HAL_GPIO_WritePin(GPIOC, GPIO_PIN_1, GPIO_PIN_RESET);
    }

    
    /* only do master state machine while rx is idle */
    if ((mstp_port->receive_state == MSTP_RECEIVE_STATE_IDLE) && (transmitting == false)) {
        //        if ((mstp_port->This_Station != 255) && (mstp_port->ReceivedValidFrameNotForUs)) {
        //            mstp_port->ReceivedValidFrameNotForUs = false;
        //            
        //            if ((mstp_port->SourceAddress == mstp_port->This_Station)) {
        //                 && automac_enabled()) {
        //                /* duplicate MAC on the wire */
        //                automac_init();
        //                mstp_port->This_Station = 255;
        //            }
        //        }
        //        else {

        // have to de-optimize the compiler here...
        bool flag = true;
        while( flag ) {
            flag = MSTP_Master_Node_FSM(mstp_port);
            /* do nothing while some states fast transition */
        }
        //        }
    }
#if 0     
    if (This_Station != 255) {
        /* if there is a packet that needs processed, do it now. */
        if (MSTP_Flag.ReceivePacketPending) {
            MSTP_Flag.ReceivePacketPending = false;
            pdu_len = DataLength;
            src->mac_len = 1;
            src->mac[0] = SourceAddress;
            /* data is already in the pdu pointer */
        }
    }
#endif        // todo1 temp
    mstp_port->ReceivedInvalidFrame = false;
    mstp_port->ReceivedValidFrame = false;
    mstp_port->ReceivedValidFrameNotForUs = false;
    
    //    CDC_Transmit_FS("-", 1);
}


void dlmstp_set_mac_address(
    uint8_t mac_address)
{
    /* Master Nodes can only have address 0-127 */
    if (mac_address <= 127) {
        MSTP_Port.This_Station = mac_address;
        /* FIXME: implement your data storage */
        /* I2C_Write_Byte(
           EEPROM_DEVICE_ADDRESS,
           mac_address,
           EEPROM_MSTP_MAC_ADDR); */
        if (mac_address > MSTP_Port.Nmax_master)
            dlmstp_set_max_master(mac_address);
    }

}

uint8_t dlmstp_mac_address(
    void)
{
    return MSTP_Port.This_Station;
}

/* This parameter represents the value of the Max_Info_Frames property of */
/* the node's Device object. The value of Max_Info_Frames specifies the */
/* maximum number of information frames the node may send before it must */
/* pass the token. Max_Info_Frames may have different values on different */
/* nodes. This may be used to allocate more or less of the available link */
/* bandwidth to particular nodes. If Max_Info_Frames is not writable in a */
/* node, its value shall be 1. */
void dlmstp_set_max_info_frames(
    uint8_t max_info_frames)
{
    if (max_info_frames >= 1) {
        MSTP_Port.Nmax_info_frames = max_info_frames;
        /* FIXME: implement your data storage */
        /* I2C_Write_Byte(
           EEPROM_DEVICE_ADDRESS,
           (uint8_t)max_info_frames,
           EEPROM_MSTP_MAX_INFO_FRAMES_ADDR); */
    }

}

uint8_t dlmstp_max_info_frames(
    void)
{
    return MSTP_Port.Nmax_info_frames;
}

/* This parameter represents the value of the Max_Master property of the */
/* node's Device object. The value of Max_Master specifies the highest */
/* allowable address for master nodes. The value of Max_Master shall be */
/* less than or equal to 127. If Max_Master is not writable in a node, */
/* its value shall be 127. */
void dlmstp_set_max_master(
    uint8_t max_master)
{
    if (max_master <= 127) {
        if (MSTP_Port.This_Station <= max_master) {
            MSTP_Port.Nmax_master = max_master;
            /* FIXME: implement your data storage */
            /* I2C_Write_Byte(
               EEPROM_DEVICE_ADDRESS,
               max_master,
               EEPROM_MSTP_MAX_MASTER_ADDR); */
        }
    }

}

uint8_t dlmstp_max_master(
    void)
{
    return MSTP_Port.Nmax_master;
}

/* RS485 Baud Rate 9600, 19200, 38400, 57600, 115200 */
void dlmstp_set_baud_rate(
    uint32_t baud)
{
    MSTP_Port.Baud_Rate = baud;
//    RS485_Set_Baud_Rate(baud);
}

//uint32_t dlmstp_baud_rate(
//    void)
//{
//    return RS485_Get_Baud_Rate();
//}

void dlmstp_get_my_address(
    BACNET_ADDRESS * my_address)
{
    int i = 0; /* counter */

    my_address->mac_len = 1;
    my_address->mac[0] = MSTP_Port.This_Station;
    my_address->net = 0; /* local only, no routing */
    my_address->len = 0;
    for (i = 0; i < MAX_MAC_LEN; i++) {
        my_address->adr[i] = 0;
    }

}

void dlmstp_get_broadcast_address(
    BACNET_ADDRESS * dest)  /* destination address */
{
    dest->mac_len = 1;
    dest->mac[0] = MSTP_BROADCAST_ADDRESS;
    dest->net = BACNET_BROADCAST_NETWORK;
    dest->len = 0; /* always zero when DNET is broadcast */
    for (int i = 0; i < MAX_MAC_LEN; i++) {
        dest->adr[i] = 0;
    }
}


